code/benchmark/tests/test.yml
---
execution:
- concurrency: 10
  ramp-up: 1m
  hold-for: 1m30s
  scenario: simple
  
scenarios:
  simple:
    think-time: 0.75
    requests:
    - url: http://172.16.10.11:2379/v2/keys/foo
      method: PUT
      body:
        value: "bar"
    - url: http://172.16.10.11:2379/v2/keys/foo
      method: GET
    - url: http://172.16.10.11:2379/metrics
      method: GET